# Handling Missing Data with Pandas

__Pandas__ borrows all the capabilities from numpy selection + adds a number of convenient methods to handle missing values. Let's see one at a time.

In [1]:
import numpy as np
import pandas as pd

## Pandas utility functions

Similary to __numpy__, __pandas__ also has a few utility functions to identify and detect null values:

In [2]:
pd.isnull(np.nan)

True

In [3]:
pd.isnull(None)

True

In [4]:
pd.isna(np.nan)

True

In [5]:
pd.isna(None)

True

The opposite ones also exist

In [6]:
pd.notnull(None)

False

In [7]:
pd.notnull(np.nan)

False

In [8]:
pd.notnull(3)

True

These function also work with Series and __DataFrame__ s

In [9]:
pd.isnull(pd.Series([1, np.nan, 7]))

0    False
1     True
2    False
dtype: bool

In [10]:
pd.notnull(pd.Series([1, np.nan, 7]))

0     True
1    False
2     True
dtype: bool

In [11]:
pd.isnull(pd.DataFrame({
    'Col A': [1, np.nan, 7],
    'Col B': [np.nan, 2, 3],
    'Col C': [np.nan, 2, np.nan]
}))

   Col A  Col B  Col C
0  False   True   True
1   True  False  False
2  False  False   True

.

## Pandas Operations with Missing Values

Pandas manages missing values more gracefully than numpy. __nan__ s will no longer behave as "viruses", and operations will just ignore them completley:

In [12]:
pd.Series([1, 2, np.nan]).count()

2

In [13]:
pd.Series([1, 2, np.nan]).sum()

3.0

In [14]:
pd.Series([1, 2, np.nan]).mean()

1.5

### Filtering missing data

As we saw with numpy, we could combine boolean selection + __pd.isnull__ to filter out those __nan__ s and null values:

In [15]:
s = pd.Series([1, 2, 3, np.nan, np.nan, 4])

In [16]:
pd.notnull(s)

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [17]:
pd.notnull(s).count()

6

In [18]:
pd.notnull(s).sum()

4

In [19]:
s[pd.notnull(s)]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [20]:
s.isnull()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [21]:
s.notnull()

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [22]:
s[s.notnull()]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [23]:
s[s.isnull()]

3   NaN
4   NaN
dtype: float64

### Dropping null values

In [24]:
s.dropna()

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [25]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

### Dropping null values on __DataFrames__

In [26]:
df = pd.DataFrame({
    'Col A': [1, np.nan, 30, np.nan],
    'Col B': [2, 8 , 31, np.nan],
    'Col C': [np.nan, 9, 32, 100],
    'Col D': [5, 8, 34, 110],
})

In [27]:
df

   Col A  Col B  Col C  Col D
0    1.0    2.0    NaN      5
1    NaN    8.0    9.0      8
2   30.0   31.0   32.0     34
3    NaN    NaN  100.0    110

In [28]:
df.isnull()

   Col A  Col B  Col C  Col D
0  False  False   True  False
1   True  False  False  False
2  False  False  False  False
3   True   True  False  False

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Col A   2 non-null      float64
 1   Col B   3 non-null      float64
 2   Col C   3 non-null      float64
 3   Col D   4 non-null      int64
dtypes: float64(3), int64(1)
memory usage: 256.0 bytes

In [30]:
df.isnull().sum()

Col A    2
Col B    1
Col C    1
Col D    0
dtype: int64

In [31]:
df.dropna()

   Col A  Col B  Col C  Col D
2   30.0   31.0   32.0     34

In [32]:
df

   Col A  Col B  Col C  Col D
0    1.0    2.0    NaN      5
1    NaN    8.0    9.0      8
2   30.0   31.0   32.0     34
3    NaN    NaN  100.0    110

In [33]:
df.dropna(axis=0)

   Col A  Col B  Col C  Col D
2   30.0   31.0   32.0     34

In [34]:
df.dropna(axis=1)

   Col D
0      5
1      8
2     34
3    110

In [35]:
df.dropna(how='all')

   Col A  Col B  Col C  Col D
0    1.0    2.0    NaN      5
1    NaN    8.0    9.0      8
2   30.0   31.0   32.0     34
3    NaN    NaN  100.0    110

In [36]:
df.dropna(how='any')

   Col A  Col B  Col C  Col D
2   30.0   31.0   32.0     34

In [37]:
df.dropna(thresh=3)

   Col A  Col B  Col C  Col D
0    1.0    2.0    NaN      5
1    NaN    8.0    9.0      8
2   30.0   31.0   32.0     34

In [38]:
df.dropna(thresh=3, axis='columns')

   Col B  Col C  Col D
0    2.0    NaN      5
1    8.0    9.0      8
2   31.0   32.0     34
3    NaN  100.0    110

### Fill null values

In [39]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

#### Filling null with an arbitary value

In [40]:
s.fillna(0)

0    1.0
1    2.0
2    3.0
3    0.0
4    0.0
5    4.0
dtype: float64

In [41]:
s.fillna(s.mean())

0    1.0
1    2.0
2    3.0
3    2.5
4    2.5
5    4.0
dtype: float64

In [42]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

#### Filling nulls with contigous (close) value

In [43]:
s.fillna(method='ffill')

0    1.0
1    2.0
2    3.0
3    3.0
4    3.0
5    4.0
dtype: float64

In [44]:
s.fillna(method='bfill')

0    1.0
1    2.0
2    3.0
3    4.0
4    4.0
5    4.0
dtype: float64

#### This can still leave null values at the extremes of the Series/DataFrame:

In [45]:
pd.Series([np.nan, 3, np.nan, 9]).fillna(method='ffill')

0    NaN
1    3.0
2    3.0
3    9.0
dtype: float64

In [46]:
pd.Series([1, np.nan, 3, np.nan, np.nan]).fillna(method='bfill')

0    1.0
1    3.0
2    3.0
3    NaN
4    NaN
dtype: float64

### Filling null values on __DataFrames__

In [47]:
df

   Col A  Col B  Col C  Col D
0    1.0    2.0    NaN      5
1    NaN    8.0    9.0      8
2   30.0   31.0   32.0     34
3    NaN    NaN  100.0    110

In [48]:
df.fillna({'Col A': 0, 'Col B': 99, 'Col C':df['Col C'].mean()})

   Col A  Col B  Col C  Col D
0    1.0    2.0   47.0      5
1    0.0    8.0    9.0      8
2   30.0   31.0   32.0     34
3    0.0   99.0  100.0    110

In [49]:
df.fillna(method='ffill', axis=0)

   Col A  Col B  Col C  Col D
0    1.0    2.0    NaN      5
1    1.0    8.0    9.0      8
2   30.0   31.0   32.0     34
3   30.0   31.0  100.0    110

In [50]:
df.fillna(method='ffill', axis=1)

   Col A  Col B  Col C  Col D
0    1.0    2.0    2.0    5.0
1    NaN    8.0    9.0    8.0
2   30.0   31.0   32.0   34.0
3    NaN    NaN  100.0  110.0

### Checking if there are NAs

__Example 1: Checking the length__

In [51]:
s.dropna().count()

4

In [52]:
missing_values = len(s.dropna()) != len(s)
missing_values

True

In [53]:
len(s)

6

In [54]:
s.count()

4

In [56]:
missing_values = len(s) != s.count()
missing_values

True

__More Pythonic solution 'any'__

In [57]:
pd.Series([True, False, False]).any()

True

In [58]:
pd.Series([True, False, False]).all()

False

In [59]:
pd.Series([True, True, True]).all()

True

In [60]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [61]:
s.isnull()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool